---
kind: property
id: P:Autodesk.Revit.DB.ConnectionValidationWarning.Resolution
source: html/3ba5cf6d-0e62-e6cf-49c7-e16af844c83b.htm
---
# Autodesk.Revit.DB.ConnectionValidationWarning.Resolution Property

Enumeration for resolution that was applied.

## Syntax (C#)
```csharp
public ConnectionResolution Resolution { get; }
```